Repository: yotsuda/PowerShell.MCP
Catalog: PowerShell.MCP.Proxy/Resources/PromptDescriptions.*.resx
Languages: ar_sa, de_de, es_es, fr_fr, id_id, it_it, ja_jp, ko_kr, pl_pl, pt_br, ro_ro, ru_ru, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_tw

# Prompt_SoftwareDevelopment_Name
source: Software Development
ar_sa: تطوير البرمجيات
de_de: Softwareentwicklung
es_es: Desarrollo de software
fr_fr: Développement de logiciels
id_id: Pengembangan perangkat lunak
it_it: Sviluppo software
ja_jp: ソフトウェア開発
ko_kr: 소프트웨어 개발
pl_pl: Tworzenie oprogramowania
pt_br: Desenvolvimento de software
ro_ro: Dezvoltare software
ru_ru: Разработка программного обеспечения
th_th: การพัฒนาซอฟต์แวร์
tr_tr: Yazılım geliştirme
uk_ua: Розробка програмного забезпечення
vi_vn: Phát triển phần mềm
zh_cn: 软件开发
zh_tw: 軟體開發

# Prompt_SoftwareDevelopment_Param_Technology
source: Programming language or technology
ar_sa: لغة البرمجة أو التقنية
de_de: Programmiersprache oder Technologie
es_es: Lenguaje de programación o tecnología
fr_fr: Langage de programmation ou technologie
id_id: Bahasa pemrograman atau teknologi
it_it: Linguaggio di programmazione o tecnologia
ja_jp: プログラミング言語または技術
ko_kr: 프로그래밍 언어 또는 기술
pl_pl: Język programowania lub technologia
pt_br: Linguagem de programação ou tecnologia
ro_ro: Limbaj de programare sau tehnologie
ru_ru: Язык программирования или технология
th_th: ภาษาโปรแกรมหรือเทคโนโลยี
tr_tr: Programlama dili veya teknoloji
uk_ua: Мова програмування або технологія
vi_vn: Ngôn ngữ lập trình hoặc công nghệ
zh_cn: 编程语言或技术
zh_tw: 程式語言或技術

# Prompt_SoftwareDevelopment_Param_TaskType
source: Development task type
ar_sa: نوع مهمة التطوير
de_de: Art der Entwicklungsaufgabe
es_es: Tipo de tarea de desarrollo
fr_fr: Type de tâche de développement
id_id: Jenis tugas pengembangan
it_it: Tipo di attività di sviluppo
ja_jp: 開発タスクの種類
ko_kr: 개발 작업 유형
pl_pl: Typ zadania rozwojowego
pt_br: Tipo de tarefa de desenvolvimento
ro_ro: Tipul sarcinii de dezvoltare
ru_ru: Тип задачи разработки
th_th: ประเภทงานพัฒนา
tr_tr: Geliştirme görevi türü
uk_ua: Тип задачі розробки
vi_vn: Loại nhiệm vụ phát triển
zh_cn: 开发任务类型
zh_tw: 開發任務類型

# Prompt_SoftwareDevelopment_Param_ProjectPath
source: Path to the project folder
ar_sa: مسار مجلد المشروع
de_de: Pfad zum Projektordner
es_es: Ruta de la carpeta del proyecto
fr_fr: Chemin du dossier de projet
id_id: Jalur ke folder proyek
it_it: Percorso della cartella del progetto
ja_jp: プロジェクトフォルダへのパス
ko_kr: 프로젝트 폴더 경로
pl_pl: Ścieżka do folderu projektu
pt_br: Caminho da pasta do projeto
ro_ro: Calea către dosarul proiectului
ru_ru: Путь к папке проекта
th_th: เส้นทางไปยังโฟลเดอร์โครงการ
tr_tr: Proje klasörü yolu
uk_ua: Шлях до папки проєкту
vi_vn: Đường dẫn đến thư mục dự án
zh_cn: 项目文件夹路径
zh_tw: 專案資料夾路徑

# Prompt_AnalyzeContent_Name
source: Analyze Content
ar_sa: تحليل المحتوى
de_de: Inhaltsanalyse
es_es: Análisis de contenido
fr_fr: Analyse de contenu
id_id: Analisis konten
it_it: Analisi contenuto
ja_jp: コンテンツ分析
ko_kr: 콘텐츠 분석
pl_pl: Analiza treści
pt_br: Análise de conteúdo
ro_ro: Analiză conținut
ru_ru: Анализ содержимого
th_th: วิเคราะห์เนื้อหา
tr_tr: İçerik analizi
uk_ua: Аналіз вмісту
vi_vn: Phân tích nội dung
zh_cn: 内容分析
zh_tw: 內容分析

# Prompt_AnalyzeContent_Param_ContentPath
source: Path to content for analysis
ar_sa: مسار المحتوى المراد تحليله
de_de: Pfad zum zu analysierenden Inhalt
es_es: Ruta del contenido a analizar
fr_fr: Chemin du contenu à analyser
id_id: Jalur ke konten yang akan dianalisis
it_it: Percorso del contenuto da analizzare
ja_jp: 分析対象コンテンツのパス
ko_kr: 분석할 콘텐츠 경로
pl_pl: Ścieżka do treści do analizy
pt_br: Caminho do conteúdo a ser analisado
ro_ro: Calea către conținutul de analizat
ru_ru: Путь к содержимому для анализа
th_th: เส้นทางไปยังเนื้อหาสำหรับการวิเคราะห์
tr_tr: Analiz edilecek içerik yolu
uk_ua: Шлях до вмісту для аналізу
vi_vn: Đường dẫn đến nội dung để phân tích
zh_cn: 要分析的内容路径
zh_tw: 要分析的內容路徑

# Prompt_SystemAdministration_Name
source: System Administration
ar_sa: إدارة النظام
de_de: Systemverwaltung
es_es: Administración del sistema
fr_fr: Administration système
id_id: Administrasi sistem
it_it: Amministrazione di sistema
ja_jp: システム管理
ko_kr: 시스템 관리
pl_pl: Administracja systemem
pt_br: Administração do sistema
ro_ro: Administrare sistem
ru_ru: Системное администрирование
th_th: การบริหารระบบ
tr_tr: Sistem yönetimi
uk_ua: Системне адміністрування
vi_vn: Quản trị hệ thống
zh_cn: 系统管理
zh_tw: 系統管理

# Prompt_SystemAdministration_Param_TaskType
source: System administration task type
ar_sa: نوع مهمة إدارة النظام
de_de: Art der Systemverwaltungsaufgabe
es_es: Tipo de tarea de administración del sistema
fr_fr: Type de tâche d'administration système
id_id: Jenis tugas administrasi sistem
it_it: Tipo di attività di amministrazione di sistema
ja_jp: システム管理タスクの種類
ko_kr: 시스템 관리 작업 유형
pl_pl: Typ zadania administracji systemem
pt_br: Tipo de tarefa de administração do sistema
ro_ro: Tipul sarcinii de administrare sistem
ru_ru: Тип задачи системного администрирования
th_th: ประเภทงานบริหารระบบ
tr_tr: Sistem yönetimi görevi türü
uk_ua: Тип задачі системного адміністрування
vi_vn: Loại nhiệm vụ quản trị hệ thống
zh_cn: 系统管理任务类型
zh_tw: 系統管理任務類型

# Prompt_SystemAdministration_Param_RequiredModule
source: PowerShell module for task execution (optional)
ar_sa: وحدة PowerShell للمهمة (اختياري)
de_de: PowerShell-Modul für Aufgabe (optional)
es_es: Módulo PowerShell para la tarea (opcional)
fr_fr: Module PowerShell pour la tâche (optionnel)
id_id: Modul PowerShell untuk tugas (opsional)
it_it: Modulo PowerShell per l'attività (facoltativo)
ja_jp: タスク実行用 PowerShell モジュール（任意）
ko_kr: 작업에 필요한 PowerShell 모듈(선택 사항)
pl_pl: Moduł PowerShell dla zadania (opcjonalnie)
pt_br: Módulo PowerShell para a tarefa (opcional)
ro_ro: Modul PowerShell pentru sarcină (opțional)
ru_ru: Модуль PowerShell для задачи (необязательно)
th_th: โมดูล PowerShell สำหรับการทำงาน (ไม่บังคับ)
tr_tr: Görev için PowerShell modülü (isteğe bağlı)
uk_ua: Модуль PowerShell для виконання задачі (необов'язково)
vi_vn: Module PowerShell cho việc thực thi nhiệm vụ (tùy chọn)
zh_cn: 任务所需的 PowerShell 模块（可选）
zh_tw: 任務所需的 PowerShell 模組（選填）

# Prompt_LearnProgrammingLanguage_Name
source: Learn Programming Language
ar_sa: تعلم لغة البرمجة
de_de: Programmiersprache lernen
es_es: Aprender lenguaje de programación
fr_fr: Apprendre un langage de programmation
id_id: Belajar bahasa pemrograman
it_it: Impara linguaggio di programmazione
ja_jp: プログラミング言語を学ぶ
ko_kr: 프로그래밍 언어 배우기
pl_pl: Naucz się języka programowania
pt_br: Aprender linguagem de programação
ro_ro: Învață limbaj de programare
ru_ru: Изучить язык программирования
th_th: เรียนรู้ภาษาโปรแกรม
tr_tr: Programlama dili öğren
uk_ua: Вивчення мови програмування
vi_vn: Học ngôn ngữ lập trình
zh_cn: 学习编程语言
zh_tw: 學習程式語言

# Prompt_LearnProgrammingLanguage_Param_ProgrammingLanguage
source: Python, C#, JavaScript, Java, Go, Rust, etc.
ar_sa: Python، C#، JavaScript، Java، Go، Rust، إلخ.
de_de: Python, C#, JavaScript, Java, Go, Rust, usw.
id_id: Python, C#, JavaScript, Java, Go, Rust, dll.
it_it: Python, C#, JavaScript, Java, Go, Rust, ecc.
ja_jp: Python, C#, JavaScript, Java, Go, Rust など
ko_kr: Python, C#, JavaScript, Java, Go, Rust 등
pl_pl: Python, C#, JavaScript, Java, Go, Rust, itp.
ru_ru: Python, C#, JavaScript, Java, Go, Rust и т.д.
th_th: Python, C#, JavaScript, Java, Go, Rust ฯลฯ
tr_tr: Python, C#, JavaScript, Java, Go, Rust, vb.
uk_ua: Python, C#, JavaScript, Java, Go, Rust тощо
vi_vn: Python, C#, JavaScript, Java, Go, Rust, v.v.
zh_cn: Python、C#、JavaScript、Java、Go、Rust 等
zh_tw: Python、C#、JavaScript、Java、Go、Rust 等

# Prompt_CreateWorkProcedure_Name
source: Create Work Procedure
ar_sa: إنشاء وثيقة إجراء العمل
de_de: Arbeitsanweisung erstellen
es_es: Crear documento de procedimiento de trabajo
fr_fr: Créer un document de procédure de travail
id_id: Buat dokumen prosedur kerja
it_it: Crea documento di procedura di lavoro
ja_jp: 作業手順書を作成
ko_kr: 작업 절차서 생성
pl_pl: Utwórz dokument procedury roboczej
pt_br: Criar documento de procedimento de trabalho
ro_ro: Creează document de procedură de lucru
ru_ru: Создать документ рабочей процедуры
th_th: สร้างเอกสารขั้นตอนการทำงาน
tr_tr: Çalışma prosedürü belgesi oluştur
uk_ua: Створення документа робочої процедури
vi_vn: Tạo tài liệu quy trình làm việc
zh_cn: 创建工作流程文档
zh_tw: 建立工作流程文件

# Prompt_CreateWorkProcedure_Param_WorkDescription
source: Description of the work or project
ar_sa: وصف العمل أو المشروع
de_de: Beschreibung der Arbeit oder des Projekts
es_es: Descripción del trabajo o proyecto
fr_fr: Description du travail ou du projet
id_id: Deskripsi pekerjaan atau proyek
it_it: Descrizione del lavoro o progetto
ja_jp: 作業またはプロジェクトの説明
ko_kr: 작업 또는 프로젝트 설명
pl_pl: Opis pracy lub projektu
pt_br: Descrição do trabalho ou projeto
ro_ro: Descrierea lucrării sau proiectului
ru_ru: Описание работы или проекта
th_th: คำอธิบายงานหรือโครงการ
tr_tr: İş veya proje açıklaması
uk_ua: Опис роботи або проєкту
vi_vn: Mô tả công việc hoặc dự án
zh_cn: 工作或项目说明
zh_tw: 工作或專案說明

# Prompt_CreateWorkProcedure_Param_WorkingDirectory
source: Working directory to analyze
ar_sa: دليل العمل المراد تحليله
de_de: Zu analysierendes Arbeitsverzeichnis
es_es: Directorio de trabajo a analizar
fr_fr: Répertoire de travail à analyser
id_id: Direktori kerja yang akan dianalisis
it_it: Directory di lavoro da analizzare
ja_jp: 分析対象の作業ディレクトリ
ko_kr: 분석할 작업 디렉터리
pl_pl: Katalog roboczy do analizy
pt_br: Diretório de trabalho a ser analisado
ro_ro: Directorul de lucru de analizat
ru_ru: Рабочий каталог для анализа
th_th: ไดเรกทอรีการทำงานเพื่อวิเคราะห์
tr_tr: Analiz edilecek çalışma dizini
uk_ua: Робочий каталог для аналізу
vi_vn: Thư mục làm việc để phân tích
zh_cn: 要分析的工作目录
zh_tw: 要分析的工作目錄

# Prompt_CreateWorkProcedure_Param_FocusArea
source: Specific focus area
ar_sa: منطقة التركيز المحددة
de_de: Spezifischer Schwerpunktbereich
es_es: Área de enfoque específica
fr_fr: Domaine d'intérêt spécifique
id_id: Area fokus tertentu
it_it: Area di interesse specifica
ja_jp: 特定の重点領域
ko_kr: 특정 중점 영역
pl_pl: Konkretny obszar zainteresowania
pt_br: Área de foco específica
ro_ro: Zonă de focus specifică
ru_ru: Конкретная область фокуса
th_th: พื้นที่เน้นเฉพาะ
tr_tr: Belirli odak alanı
uk_ua: Конкретна область фокусу
vi_vn: Lĩnh vực tập trung cụ thể
zh_cn: 特定重点领域
zh_tw: 特定重點領域

# Prompt_ExecuteWorkProcedure_Name
source: Execute Work Procedure
ar_sa: تنفيذ وثيقة إجراء العمل
de_de: Arbeitsanweisung ausführen
es_es: Ejecutar documento de procedimiento de trabajo
fr_fr: Exécuter un document de procédure de travail
id_id: Jalankan dokumen prosedur kerja
it_it: Esegui documento di procedura di lavoro
ja_jp: 作業手順書を実行
ko_kr: 작업 절차서 실행
pl_pl: Wykonaj dokument procedury roboczej
pt_br: Executar documento de procedimento de trabalho
ro_ro: Execută document de procedură de lucru
ru_ru: Выполнить документ рабочей процедуры
th_th: ดำเนินการตามเอกสารขั้นตอนการทำงาน
tr_tr: Çalışma prosedürü belgesini yürüt
uk_ua: Виконання документа робочої процедури
vi_vn: Thực thi tài liệu quy trình làm việc
zh_cn: 执行工作流程文档
zh_tw: 執行工作流程文件

# Prompt_ExecuteWorkProcedure_Param_WorkingDirectory
source: Working directory where work will be performed
ar_sa: دليل العمل حيث سيتم تنفيذ العمل
de_de: Arbeitsverzeichnis, in dem die Arbeit ausgeführt wird
es_es: Directorio de trabajo donde se realizará el trabajo
fr_fr: Répertoire de travail où le travail sera effectué
id_id: Direktori kerja tempat pekerjaan akan dilakukan
it_it: Directory di lavoro dove verrà eseguito il lavoro
ja_jp: 作業を実行するディレクトリ
ko_kr: 작업을 수행할 작업 디렉터리
pl_pl: Katalog roboczy, w którym będzie wykonywana praca
pt_br: Diretório de trabalho onde o trabalho será executado
ro_ro: Directorul de lucru unde va fi efectuată lucrarea
ru_ru: Рабочий каталог, где будет выполняться работа
th_th: ไดเรกทอรีการทำงานที่จะดำเนินการ
tr_tr: İşin gerçekleştirileceği çalışma dizini
uk_ua: Робочий каталог, де виконуватиметься робота
vi_vn: Thư mục làm việc nơi công việc sẽ được thực hiện
zh_cn: 执行工作的工作目录
zh_tw: 執行工作的工作目錄

# Prompt_LearnCliTools_Name
source: Learn CLI Tools
ar_sa: تعلم أدوات سطر الأوامر
de_de: CLI-Tools lernen
es_es: Aprender herramientas CLI
fr_fr: Apprendre les outils CLI
id_id: Belajar alat CLI
it_it: Impara strumenti CLI
ja_jp: CLI ツールを学ぶ
ko_kr: CLI 도구 배우기
pl_pl: Naucz się narzędzi CLI
pt_br: Aprender ferramentas CLI
ro_ro: Învață instrumente CLI
ru_ru: Изучить инструменты CLI
th_th: เรียนรู้เครื่องมือ CLI
tr_tr: CLI araçlarını öğren
uk_ua: Вивчення інструментів CLI
vi_vn: Học công cụ CLI
zh_cn: 学习命令行工具
zh_tw: 學習命令列工具

# Prompt_LearnCliTools_Description
source: Create hands-on learning environment for development tools
ar_sa: إنشاء بيئة تعليمية عملية لأدوات التطوير
de_de: Praktische Lernumgebung für Entwicklungswerkzeuge erstellen
es_es: Crear entorno de aprendizaje práctico para herramientas de desarrollo
fr_fr: Créer un environnement d'apprentissage pratique pour les outils de développement
id_id: Buat lingkungan pembelajaran praktis untuk alat pengembangan
it_it: Crea ambiente di apprendimento pratico per strumenti di sviluppo
ja_jp: 開発ツールの実践的な学習環境を作成
ko_kr: 개발 도구에 대한 실습 학습 환경 생성
pl_pl: Utwórz praktyczne środowisko nauki dla narzędzi programistycznych
pt_br: Criar ambiente de aprendizagem prática para ferramentas de desenvolvimento
ro_ro: Creează mediu de învățare practică pentru instrumentele de dezvoltare
ru_ru: Создать практическую среду обучения для инструментов разработки
th_th: สร้างสภาพแวดล้อมการเรียนรู้แบบปฏิบัติจริงสำหรับเครื่องมือพัฒนา
tr_tr: Geliştirme araçları için uygulamalı öğrenme ortamı oluştur
uk_ua: Створення практичного навчального середовища для інструментів розробки
vi_vn: Tạo môi trường học tập thực hành cho các công cụ phát triển
zh_cn: 为开发工具创建实践学习环境
zh_tw: 為開發工具建立實作學習環境

# Prompt_LearnCliTools_Param_CliTool
source: PowerShell, Git, Docker, kubectl, etc.
ar_sa: PowerShell، Git، Docker، kubectl، إلخ.
de_de: PowerShell, Git, Docker, kubectl, usw.
id_id: PowerShell, Git, Docker, kubectl, dll.
it_it: PowerShell, Git, Docker, kubectl, ecc.
ja_jp: PowerShell, Git, Docker, kubectl など
ko_kr: PowerShell, Git, Docker, kubectl 등
pl_pl: PowerShell, Git, Docker, kubectl, itp.
ru_ru: PowerShell, Git, Docker, kubectl и т.д.
th_th: PowerShell, Git, Docker, kubectl ฯลฯ
tr_tr: PowerShell, Git, Docker, kubectl, vb.
uk_ua: PowerShell, Git, Docker, kubectl тощо
vi_vn: PowerShell, Git, Docker, kubectl, v.v.
zh_cn: PowerShell、Git、Docker、kubectl 等
zh_tw: PowerShell、Git、Docker、kubectl 等

# Prompt_LearnCliTools_Param_ExperienceLevel
source: Beginner, Intermediate, Advanced
ar_sa: مبتدئ، متوسط، متقدم
de_de: Anfänger, Fortgeschritten, Experte
es_es: Principiante, Intermedio, Avanzado
fr_fr: Débutant, Intermédiaire, Avancé
id_id: Pemula, Menengah, Lanjutan
it_it: Principiante, Intermedio, Avanzato
ja_jp: 初心者、中級者、上級者
ko_kr: 초급, 중급, 고급
pl_pl: Początkujący, Średniozaawansowany, Zaawansowany
pt_br: Iniciante, Intermediário, Avançado
ro_ro: Începător, Intermediar, Avansat
ru_ru: Начинающий, Средний, Продвинутый
th_th: ผู้เริ่มต้น, ระดับกลาง, ระดับสูง
tr_tr: Başlangıç, Orta, İleri
uk_ua: Початковий, Середній, Просунутий
vi_vn: Người mới bắt đầu, Trung cấp, Nâng cao
zh_cn: 初学者、中级、高级
zh_tw: 初學者、中級、進階

# Prompt_ForeignLanguageDictationTraining_Name
source: Foreign Language Dictation Training
ar_sa: تدريب الإملاء باللغة الأجنبية
de_de: Fremdsprachendiktattraining
es_es: Entrenamiento de dictado en idioma extranjero
fr_fr: Formation à la dictée en langue étrangère
id_id: Latihan dikte bahasa asing
it_it: Allenamento di dettatura in lingua straniera
ja_jp: 外国語ディクテーショントレーニング
ko_kr: 외국어 받아쓰기 훈련
pl_pl: Trening dyktanda w języku obcym
pt_br: Treinamento de ditado em língua estrangeira
ro_ro: Antrenament de dictare în limbă străină
ru_ru: Тренировка диктанта на иностранном языке
th_th: การฝึกคัดลอกภาษาต่างประเทศ
tr_tr: Yabancı dil dikte eğitimi
uk_ua: Тренування диктантів іноземною мовою
vi_vn: Luyện tập chính tả ngôn ngữ ngoại
zh_cn: 外语听写训练
zh_tw: 外語聽寫訓練

# Prompt_ForeignLanguageDictationTraining_Param_TargetLanguage
source: Target language: English, French, German, Spanish, Italian, Chinese, Korean, Japanese
ar_sa: اللغة المستهدفة: الإنجليزية، الفرنسية، الألمانية، الإسبانية، الإيطالية، الصينية، الكورية، اليابانية
de_de: Zielsprache: Englisch, Französisch, Deutsch, Spanisch, Italienisch, Chinesisch, Koreanisch, Japanisch
es_es: Idioma objetivo: Inglés, Francés, Alemán, Español, Italiano, Chino, Coreano, Japonés
fr_fr: Langue cible : Anglais, Français, Allemand, Espagnol, Italien, Chinois, Coréen, Japonais
id_id: Bahasa target: Inggris, Prancis, Jerman, Spanyol, Italia, Tionghoa, Korea, Jepang
it_it: Lingua di destinazione: Inglese, Francese, Tedesco, Spagnolo, Italiano, Cinese, Coreano, Giapponese
ja_jp: 対象言語: 英語、フランス語、ドイツ語、スペイン語、イタリア語、中国語、韓国語、日本語
ko_kr: 대상 언어: 영어, 프랑스어, 독일어, 스페인어, 이탈리아어, 중국어, 한국어, 일본어
pl_pl: Język docelowy: Angielski, Francuski, Niemiecki, Hiszpański, Włoski, Chiński, Koreański, Japoński
pt_br: Idioma de destino: Inglês, Francês, Alemão, Espanhol, Italiano, Chinês, Coreano, Japonês
ro_ro: Limba țintă: Engleză, Franceză, Germană, Spaniolă, Italiană, Chineză, Coreeană, Japoneză
ru_ru: Целевой язык: Английский, Французский, Немецкий, Испанский, Итальянский, Китайский, Корейский, Японский
th_th: ภาษาเป้าหมาย: อังกฤษ, ฝรั่งเศส, เยอรมัน, สเปน, อิตาลี, จีน, เกาหลี, ญี่ปุ่น
tr_tr: Hedef dil: İngilizce, Fransızca, Almanca, İspanyolca, İtalyanca, Çince, Korece, Japonca
uk_ua: Цільова мова: англійська, французька, німецька, іспанська, італійська, китайська, корейська, японська
vi_vn: Ngôn ngữ mục tiêu: Tiếng Anh, Tiếng Pháp, Tiếng Đức, Tiếng Tây Ban Nha, Tiếng Ý, Tiếng Trung, Tiếng Hàn, Tiếng Nhật
zh_cn: 目标语言：英语、法语、德语、西班牙语、意大利语、中文、韩语、日语
zh_tw: 目標語言：英語、法語、德語、西班牙語、義大利語、中文、韓語、日語

# Prompt_ForeignLanguageDictationTraining_Param_SentenceLength
source: Short (3-5 words), Medium (6-8 words), Long (9-12 words), VeryLong (13-15 words)
ar_sa: قصيرة (3-5 كلمات)، متوسطة (6-8 كلمات)، طويلة (9-12 كلمة)، طويلة جدًا (13-15 كلمة)
de_de: Kurz (3-5 Wörter), Mittel (6-8 Wörter), Lang (9-12 Wörter), Sehr Lang (13-15 Wörter)
es_es: Corta (3-5 palabras), Media (6-8 palabras), Larga (9-12 palabras), Muy Larga (13-15 palabras)
fr_fr: Court (3-5 mots), Moyen (6-8 mots), Long (9-12 mots), Très Long (13-15 mots)
id_id: Pendek (3-5 kata), Sedang (6-8 kata), Panjang (9-12 kata), Sangat Panjang (13-15 kata)
it_it: Breve (3-5 parole), Media (6-8 parole), Lunga (9-12 parole), Molto Lunga (13-15 parole)
ja_jp: 短い（3-5 単語）、普通（6-8 単語）、長い（9-12 単語）、とても長い（13-15 単語）
ko_kr: 짧음(3-5 단어), 보통(6-8 단어), 김(9-12 단어), 매우 김(13-15 단어)
pl_pl: Krótkie (3-5 słów), Średnie (6-8 słów), Długie (9-12 słów), Bardzo Długie (13-15 słów)
pt_br: Curta (3-5 palavras), Média (6-8 palavras), Longa (9-12 palavras), Muito Longa (13-15 palavras)
ro_ro: Scurt (3-5 cuvinte), Mediu (6-8 cuvinte), Lung (9-12 cuvinte), Foarte Lung (13-15 cuvinte)
ru_ru: Короткое (3-5 слов), Среднее (6-8 слов), Длинное (9-12 слов), Очень длинное (13-15 слов)
th_th: สั้น (3-5 คำ), ปานกลาง (6-8 คำ), ยาว (9-12 คำ), ยาวมาก (13-15 คำ)
tr_tr: Kısa (3-5 kelime), Orta (6-8 kelime), Uzun (9-12 kelime), Çok Uzun (13-15 kelime)
uk_ua: Короткі (3-5 слів), Середні (6-8 слів), Довгі (9-12 слів), Дуже довгі (13-15 слів)
vi_vn: Ngắn (3-5 từ), Trung bình (6-8 từ), Dài (9-12 từ), Rất dài (13-15 từ)
zh_cn: 短句（3-5 词）、中句（6-8 词）、长句（9-12 词）、超长句（13-15 词）
zh_tw: 短句（3-5 詞）、中句（6-8 詞）、長句（9-12 詞）、超長句（13-15 詞）

# Prompt_ForeignLanguageDictationTraining_Param_SpeechSpeed
source: Slow (rate -2), Normal (rate 0), Fast (rate +2), VeryFast (rate +4)
ar_sa: بطيء (السرعة -2)، عادي (السرعة 0)، سريع (السرعة +2)، سريع جدًا (السرعة +4)
de_de: Langsam (Rate -2), Normal (Rate 0), Schnell (Rate +2), Sehr Schnell (Rate +4)
es_es: Lento (velocidad -2), Normal (velocidad 0), Rápido (velocidad +2), Muy Rápido (velocidad +4)
fr_fr: Lent (vitesse -2), Normal (vitesse 0), Rapide (vitesse +2), Très Rapide (vitesse +4)
id_id: Lambat (kecepatan -2), Normal (kecepatan 0), Cepat (kecepatan +2), Sangat Cepat (kecepatan +4)
it_it: Lento (velocità -2), Normale (velocità 0), Veloce (velocità +2), Molto Veloce (velocità +4)
ja_jp: 遅い（速度 -2）、普通（速度 0）、速い（速度 +2）、とても速い（速度 +4）
ko_kr: 느림(속도 -2), 보통(속도 0), 빠름(속도 +2), 매우 빠름(속도 +4)
pl_pl: Wolno (prędkość -2), Normalnie (prędkość 0), Szybko (prędkość +2), Bardzo Szybko (prędkość +4)
pt_br: Lenta (velocidade -2), Normal (velocidade 0), Rápida (velocidade +2), Muito Rápida (velocidade +4)
ro_ro: Lent (viteză -2), Normal (viteză 0), Rapid (viteză +2), Foarte Rapid (viteză +4)
ru_ru: Медленно (скорость -2), Нормально (скорость 0), Быстро (скорость +2), Очень быстро (скорость +4)
th_th: ช้า (อัตรา -2), ปกติ (อัตรา 0), เร็ว (อัตรา +2), เร็วมาก (อัตรา +4)
tr_tr: Yavaş (hız -2), Normal (hız 0), Hızlı (hız +2), Çok Hızlı (hız +4)
uk_ua: Повільно (швидкість -2), Нормально (швидкість 0), Швидко (швидкість +2), Дуже швидко (швидкість +4)
vi_vn: Chậm (tốc độ -2), Bình thường (tốc độ 0), Nhanh (tốc độ +2), Rất nhanh (tốc độ +4)
zh_cn: 慢速（速率 -2）、正常（速率 0）、快速（速率 +2）、超快速（速率 +4）
zh_tw: 慢速（速率 -2）、正常（速率 0）、快速（速率 +2）、超快速（速率 +4）

# Prompt_ForeignLanguageDictationTraining_Param_Topic
source: Airport, Business, Food, Hospital, School, Weather, Zoo
ar_sa: المطار، الأعمال، الطعام، المستشفى، المدرسة، الطقس، حديقة الحيوان
de_de: Flughafen, Geschäft, Essen, Krankenhaus, Schule, Wetter, Zoo
es_es: Aeropuerto, Negocios, Comida, Hospital, Escuela, Clima, Zoológico
fr_fr: Aéroport, Affaires, Nourriture, Hôpital, École, Météo, Zoo
id_id: Bandara, Bisnis, Makanan, Rumah Sakit, Sekolah, Cuaca, Kebun Binatang
it_it: Aeroporto, Affari, Cibo, Ospedale, Scuola, Meteo, Zoo
ja_jp: 空港、ビジネス、食べ物、病院、学校、天気、動物園
ko_kr: 공항, 비즈니스, 음식, 병원, 학교, 날씨, 동물원
pl_pl: Lotnisko, Biznes, Jedzenie, Szpital, Szkoła, Pogoda, Zoo
pt_br: Aeroporto, Negócios, Comida, Hospital, Escola, Clima, Zoológico
ro_ro: Aeroport, Afaceri, Mâncare, Spital, Școală, Vreme, Grădină Zoologică
ru_ru: Аэропорт, Бизнес, Еда, Больница, Школа, Погода, Зоопарк
th_th: สนามบิน, ธุรกิจ, อาหาร, โรงพยาบาล, โรงเรียน, สภาพอากาศ, สวนสัตว์
tr_tr: Havalimanı, İş, Yemek, Hastane, Okul, Hava Durumu, Hayvanat Bahçesi
uk_ua: Аеропорт, Бізнес, Їжа, Лікарня, Школа, Погода, Зоопарк
vi_vn: Sân bay, Kinh doanh, Thức ăn, Bệnh viện, Trường học, Thời tiết, Sở thú
zh_cn: 机场、商务、食物、医院、学校、天气、动物园
zh_tw: 機場、商務、食物、醫院、學校、天氣、動物園

# Prompt_ForeignLanguageDictationTraining_Param_ShowTranslation
source: Show translation alongside target language (on/off)
ar_sa: إظهار الترجمة جنبًا إلى جنب مع اللغة المستهدفة (تشغيل/إيقاف)
de_de: Übersetzung neben Zielsprache anzeigen (ein/aus)
es_es: Mostrar traducción junto con el idioma objetivo (activado/desactivado)
fr_fr: Afficher la traduction avec la langue cible (activé/désactivé)
id_id: Tampilkan terjemahan di samping bahasa target (aktif/nonaktif)
it_it: Mostra traduzione accanto alla lingua di destinazione (attivo/disattivo)
ja_jp: 対象言語と一緒に翻訳を表示（オン/オフ）
ko_kr: 대상 언어와 함께 번역 표시(켜기/끄기)
pl_pl: Pokaż tłumaczenie obok języka docelowego (włączone/wyłączone)
pt_br: Mostrar tradução junto com o idioma de destino (ligado/desligado)
ro_ro: Afișează traducerea alături de limba țintă (pornit/oprit)
ru_ru: Показать перевод рядом с целевым языком (вкл/выкл)
th_th: แสดงคำแปลควบคู่กับภาษาเป้าหมาย (เปิด/ปิด)
tr_tr: Hedef dille birlikte çeviriyi göster (açık/kapalı)
uk_ua: Показувати переклад поруч із цільовою мовою (увімк/вимк)
vi_vn: Hiển thị bản dịch bên cạnh ngôn ngữ mục tiêu (bật/tắt)
zh_cn: 在目标语言旁显示翻译（开/关）
zh_tw: 在目標語言旁顯示翻譯（開啟/關閉）
