Repository: yotsuda/PowerShell.MCP
Catalog: PowerShell.MCP.Proxy/Resources/PromptDescriptions.*.resx
Languages: ar_sa, de_de, es_es, fr_fr, id_id, it_it, ja_jp, ko_kr, pl_pl, pt_br, ro_ro, ru_ru, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_tw

# Prompt_SoftwareDevelopment_Description
source: Comprehensive software development support with coding, testing, and deployment assistance
ar_sa: دعم شامل لتطوير البرمجيات مع المساعدة في البرمجة والاختبار والنشر
de_de: Umfassende Softwareentwicklungsunterstützung mit Codierungs-, Test- und Bereitstellungshilfe
es_es: Soporte integral de desarrollo de software con asistencia en codificación, pruebas y despliegue
fr_fr: Support complet au développement logiciel avec assistance au codage, aux tests et au déploiement
id_id: Dukungan pengembangan perangkat lunak yang komprehensif dengan bantuan pengkodean, pengujian, dan penerapan
it_it: Supporto completo allo sviluppo software con assistenza per codifica, test e distribuzione
ja_jp: コーディング、テスト、デプロイメントを含む包括的なソフトウェア開発支援
ko_kr: 코딩, 테스트 및 배포 지원을 포함한 포괄적인 소프트웨어 개발 지원
pl_pl: Kompleksowe wsparcie w tworzeniu oprogramowania z pomocą w kodowaniu, testowaniu i wdrażaniu
pt_br: Suporte abrangente ao desenvolvimento de software com assistência em codificação, testes e implantação
ro_ro: Suport complet pentru dezvoltare software cu asistență pentru codare, testare și implementare
ru_ru: Комплексная поддержка разработки программного обеспечения с помощью в кодировании, тестировании и развертывании
th_th: การสนับสนุนการพัฒนาซอฟต์แวร์อย่างครอบคลุมด้วยการช่วยเหลือในการเขียนโค้ด การทดสอบ และการติดตั้ง
tr_tr: Kodlama, test ve dağıtım desteği ile kapsamlı yazılım geliştirme desteği
uk_ua: Комплексна підтримка розробки програмного забезпечення з допомогою в кодуванні, тестуванні та розгортанні
vi_vn: Hỗ trợ phát triển phần mềm toàn diện với trợ giúp về lập trình, kiểm thử và triển khai
zh_cn: 提供编码、测试和部署协助的全面软件开发支持
zh_tw: 提供編碼、測試和部署協助的全面軟體開發支援

# Prompt_AnalyzeContent_Description
source: Analyze content and provide insights with actionable recommendations
ar_sa: تحليل المحتوى وتقديم رؤى مع توصيات قابلة للتنفيذ
de_de: Inhalte analysieren und Einblicke mit umsetzbaren Empfehlungen bieten
es_es: Analizar contenido y proporcionar información con recomendaciones prácticas
fr_fr: Analyser le contenu et fournir des informations avec des recommandations exploitables
id_id: Menganalisis konten dan memberikan wawasan dengan rekomendasi yang dapat ditindaklanjuti
it_it: Analizza contenuto e fornisce approfondimenti con raccomandazioni attuabili
ja_jp: コンテンツを分析し、実行可能な推奨事項とともに洞察を提供します
ko_kr: 콘텐츠를 분석하고 실행 가능한 권장 사항과 함께 통찰력 제공
pl_pl: Analizuj treść i dostarczaj spostrzeżenia z praktycznymi zaleceniami
pt_br: Analisar conteúdo e fornecer insights com recomendações acionáveis
ro_ro: Analizează conținutul și oferă perspective cu recomandări acționabile
ru_ru: Анализировать содержимое и предоставлять информацию с практическими рекомендациями
th_th: วิเคราะห์เนื้อหาและให้ข้อมูลเชิงลึกพร้อมคำแนะนำที่ปฏิบัติได้
tr_tr: İçeriği analiz et ve uygulanabilir önerilerle içgörüler sağla
uk_ua: Аналіз вмісту та надання інсайтів з практичними рекомендаціями
vi_vn: Phân tích nội dung và cung cấp thông tin chi tiết với các khuyến nghị có thể thực hiện
zh_cn: 分析内容并提供可行的建议和见解
zh_tw: 分析內容並提供可行的建議和見解

# Prompt_SystemAdministration_Description
source: Execute and automate system administration tasks with PowerShell
ar_sa: تنفيذ وأتمتة مهام إدارة النظام باستخدام PowerShell
de_de: Systemverwaltungsaufgaben mit PowerShell ausführen und automatisieren
es_es: Ejecutar y automatizar tareas de administración del sistema con PowerShell
fr_fr: Exécuter et automatiser les tâches d'administration système avec PowerShell
id_id: Menjalankan dan mengotomatiskan tugas administrasi sistem dengan PowerShell
it_it: Esegui e automatizza attività di amministrazione di sistema con PowerShell
ja_jp: PowerShell を使用してシステム管理タスクを実行および自動化します
ko_kr: PowerShell을 사용하여 시스템 관리 작업 실행 및 자동화
pl_pl: Wykonuj i automatyzuj zadania administracji systemem za pomocą PowerShell
pt_br: Executar e automatizar tarefas de administração do sistema com PowerShell
ro_ro: Execută și automatizează sarcinile de administrare sistem cu PowerShell
ru_ru: Выполнять и автоматизировать задачи системного администрирования с помощью PowerShell
th_th: ดำเนินการและทำงานบริหารระบบอัตโนมัติด้วย PowerShell
tr_tr: PowerShell ile sistem yönetimi görevlerini yürüt ve otomatikleştir
uk_ua: Виконання та автоматизація задач системного адміністрування за допомогою PowerShell
vi_vn: Thực thi và tự động hóa các nhiệm vụ quản trị hệ thống với PowerShell
zh_cn: 使用 PowerShell 执行和自动化系统管理任务
zh_tw: 使用 PowerShell 執行和自動化系統管理任務

# Prompt_LearnProgrammingLanguage_Description
source: Create learning environment and guide step-by-step programming language learning with hands-on practice
ar_sa: إنشاء بيئة تعليمية وتوجيه تعلم لغة البرمجة خطوة بخطوة مع الممارسة
de_de: Lernumgebung erstellen und Schritt-für-Schritt-Programmiersprache mit praktischer Übung lernen
es_es: Crear entorno de aprendizaje y guiar el aprendizaje paso a paso del lenguaje de programación con práctica
fr_fr: Créer un environnement d'apprentissage et guider l'apprentissage pas à pas du langage de programmation avec pratique
id_id: Buat lingkungan pembelajaran dan pandu pembelajaran bahasa pemrograman langkah demi langkah dengan praktik
it_it: Crea ambiente di apprendimento e guida l'apprendimento passo-passo del linguaggio di programmazione con pratica
ja_jp: 学習環境を作成し、ハンズオン実践を通じてプログラミング言語を段階的に学習します
ko_kr: 학습 환경을 만들고 실습을 통해 프로그래밍 언어를 단계별로 학습
pl_pl: Utwórz środowisko nauki i prowadź krok po kroku naukę języka programowania z praktyką
pt_br: Criar ambiente de aprendizagem e guiar o aprendizado passo a passo da linguagem de programação com prática
ro_ro: Creează mediu de învățare și ghidează învățarea pas cu pas a limbajului de programare cu practică
ru_ru: Создать среду обучения и пошагово изучать язык программирования с практикой
th_th: สร้างสภาพแวดล้อมการเรียนรู้และแนะนำการเรียนรู้ภาษาโปรแกรมทีละขั้นตอนด้วยการปฏิบัติจริง
tr_tr: Öğrenme ortamı oluştur ve pratik ile adım adım programlama dili öğrenimini yönlendir
uk_ua: Створення навчального середовища та покрокове керівництво вивченням мови програмування з практичною практикою
vi_vn: Tạo môi trường học tập và hướng dẫn từng bước học ngôn ngữ lập trình với thực hành thực tế
zh_cn: 创建学习环境，通过实践逐步指导编程语言学习
zh_tw: 建立學習環境，透過實作逐步指導程式語言學習

# Prompt_CreateWorkProcedure_Description
source: Create work procedure and progress tracking files.
ar_sa: إنشاء وثيقة إجراء العمل وملفات تتبع التقدم.
de_de: Arbeitsanweisung und Fortschrittsverfolgungsdateien erstellen.
es_es: Crear documento de procedimiento de trabajo y archivos de seguimiento del progreso.
fr_fr: Créer un document de procédure de travail et des fichiers de suivi de la progression.
id_id: Buat dokumen prosedur kerja dan file pelacakan kemajuan.
it_it: Crea documento di procedura di lavoro e file di monitoraggio dei progressi.
ja_jp: 作業手順書と進捗追跡ファイルを作成します。
ko_kr: 작업 절차서 및 진행 상황 추적 파일을 생성합니다.
pl_pl: Utwórz dokument procedury roboczej i pliki śledzenia postępu.
pt_br: Criar documento de procedimento de trabalho e arquivos de acompanhamento do progresso.
ro_ro: Creează document de procedură de lucru și fișiere de urmărire a progresului.
ru_ru: Создать документ рабочей процедуры и файлы отслеживания прогресса.
th_th: สร้างเอกสารขั้นตอนการทำงานและไฟล์ติดตามความคืบหน้า
tr_tr: Çalışma prosedürü belgesi ve ilerleme takip dosyaları oluştur.
uk_ua: Створення документа робочої процедури та файлів відстеження прогресу.
vi_vn: Tạo tài liệu quy trình làm việc và các tệp theo dõi tiến độ.
zh_cn: 创建工作流程文档和进度跟踪文件。
zh_tw: 建立工作流程文件和進度追蹤檔案。

# Prompt_ExecuteWorkProcedure_Description
source: Execute work procedure and track progress with continuous improvement.
ar_sa: تنفيذ وثيقة إجراء العمل وتتبع التقدم مع التحسين المستمر.
de_de: Arbeitsanweisung ausführen und Fortschritt mit kontinuierlicher Verbesserung verfolgen.
es_es: Ejecutar documento de procedimiento de trabajo y realizar seguimiento del progreso con mejora continua.
fr_fr: Exécuter un document de procédure de travail et suivre la progression avec amélioration continue.
id_id: Jalankan dokumen prosedur kerja dan lacak kemajuan dengan perbaikan berkelanjutan.
it_it: Esegui documento di procedura di lavoro e monitora i progressi con miglioramento continuo.
ja_jp: 作業手順書を実行し、継続的改善とともに進捗を追跡します。
ko_kr: 작업 절차서를 실행하고 지속적인 개선을 통해 진행 상황을 추적합니다.
pl_pl: Wykonaj dokument procedury roboczej i śledź postęp z ciągłym doskonaleniem.
pt_br: Executar documento de procedimento de trabalho e acompanhar o progresso com melhoria contínua.
ro_ro: Execută document de procedură de lucru și urmărește progresul cu îmbunătățire continuă.
ru_ru: Выполнить документ рабочей процедуры и отслеживать прогресс с постоянным улучшением.
th_th: ดำเนินการตามเอกสารขั้นตอนการทำงานและติดตามความคืบหน้าพร้อมการปรับปรุงอย่างต่อเนื่อง
tr_tr: Çalışma prosedürü belgesini yürüt ve sürekli iyileştirme ile ilerlemeyi takip et.
uk_ua: Виконання документа робочої процедури та відстеження прогресу з безперервним удосконаленням.
vi_vn: Thực thi tài liệu quy trình làm việc và theo dõi tiến độ với cải tiến liên tục.
zh_cn: 执行工作流程文档并通过持续改进跟踪进度。
zh_tw: 執行工作流程文件並透過持續改進追蹤進度。

# Prompt_ForeignLanguageDictationTraining_Description
source: Start fast-paced foreign language dictation training with PowerShell audio and AI evaluation
ar_sa: بدء تدريب الإملاء السريع باللغة الأجنبية مع صوت PowerShell وتقييم الذكاء الاصطناعي
de_de: Schnelles Fremdsprachendiktattraining mit PowerShell-Audio und KI-Bewertung starten
es_es: Iniciar entrenamiento rápido de dictado en idioma extranjero con audio PowerShell y evaluación IA
fr_fr: Commencer la formation rapide à la dictée en langue étrangère avec audio PowerShell et évaluation IA
id_id: Mulai latihan dikte bahasa asing yang cepat dengan audio PowerShell dan evaluasi AI
it_it: Inizia allenamento rapido di dettatura in lingua straniera con audio PowerShell e valutazione AI
ja_jp: PowerShell 音声と AI 評価を使用した高速外国語ディクテーショントレーニングを開始します
ko_kr: PowerShell 오디오 및 AI 평가를 사용한 빠른 외국어 받아쓰기 훈련 시작
pl_pl: Rozpocznij szybki trening dyktanda w języku obcym z dźwiękiem PowerShell i oceną AI
pt_br: Iniciar treinamento rápido de ditado em língua estrangeira com áudio PowerShell e avaliação de IA
ro_ro: Începe antrenamentul rapid de dictare în limbă străină cu audio PowerShell și evaluare AI
ru_ru: Начать быструю тренировку диктанта на иностранном языке с аудио PowerShell и оценкой ИИ
th_th: เริ่มการฝึกคัดลอกภาษาต่างประเทศแบบเร่งรัดด้วยเสียง PowerShell และการประเมินโดย AI
tr_tr: PowerShell ses ve AI değerlendirmesi ile hızlı yabancı dil dikte eğitimine başla
uk_ua: Початок швидкого тренування диктантів іноземною мовою з аудіо PowerShell та оцінкою ШІ
vi_vn: Bắt đầu luyện tập chính tả ngôn ngữ ngoại nhịp độ nhanh với âm thanh PowerShell và đánh giá AI
zh_cn: 使用 PowerShell 音频和 AI 评估开始快节奏外语听写训练
zh_tw: 使用 PowerShell 音訊和 AI 評估開始快節奏外語聽寫訓練

# Param_LearnCliTools_CliTool_Name
source: CLI Tool
ar_sa: أداة سطر الأوامر
es_es: Herramienta CLI
fr_fr: Outil CLI
id_id: Alat CLI
it_it: Strumento CLI
ja_jp: CLI ツール
ko_kr: CLI 도구
pl_pl: Narzędzie CLI
pt_br: Ferramenta CLI
ro_ro: Instrument CLI
ru_ru: Инструмент CLI
th_th: เครื่องมือ CLI
tr_tr: CLI aracı
uk_ua: Інструмент CLI
vi_vn: Công cụ CLI
zh_cn: 命令行工具
zh_tw: 命令列工具

# Param_LearnCliTools_ExperienceLevel_Name
source: Experience Level
ar_sa: مستوى الخبرة
de_de: Erfahrungsstufe
es_es: Nivel de experiencia
fr_fr: Niveau d'expérience
id_id: Tingkat pengalaman
it_it: Livello di esperienza
ja_jp: 経験レベル
ko_kr: 경험 수준
pl_pl: Poziom doświadczenia
pt_br: Nível de experiência
ro_ro: Nivel de experiență
ru_ru: Уровень опыта
th_th: ระดับประสบการณ์
tr_tr: Deneyim seviyesi
uk_ua: Рівень досвіду
vi_vn: Mức độ kinh nghiệm
zh_cn: 经验水平
zh_tw: 經驗水準

# Prompt_CreateInteractiveMap_Name
source: Create interactive map
ar_sa: إنشاء خريطة تفاعلية
de_de: Interaktive Karte erstellen
es_es: Crear mapa interactivo
fr_fr: Créer une carte interactive
id_id: Buat Peta Interaktif
it_it: Crea mappa interattiva
ja_jp: インタラクティブな地図を作成
ko_kr: 지도 만들기
pl_pl: Utwórz mapę interaktywną
pt_br: Criar mapa
ro_ro: Creează hartă interactivă
ru_ru: Создать интерактивную карту
th_th: สร้างแผนที่เชิงโต้ตอบ
tr_tr: İnteraktif harita oluştur
uk_ua: Створити інтерактивну карту
zh_cn: 创建互动地图
zh_tw: 建立地圖

# Prompt_CreateInteractiveMap_Description
source: Create themed interactive maps using PowerShell.Map (hot springs tours, ramen maps, etc.)
ar_sa: إنشاء خرائط موضوعية باستخدام PowerShell.Map (المقاهي، الأسواق، المعالم، إلخ)
de_de: Themenkarten mit PowerShell.Map erstellen (Biergärten, traditionelle Bäckereien, Weihnachtsmärkte usw.)
es_es: Crear mapas interactivos temáticos con PowerShell.Map (bares de tapas, plazas históricas, mercados, etc.)
fr_fr: Créer des cartes thématiques avec PowerShell.Map (vignobles, pâtisseries, marchés locaux, etc.)
id_id: Buat peta bertema menggunakan PowerShell.Map (warung kopi, pasar, tempat wisata, dll.)
it_it: Crea mappe tematiche con PowerShell.Map (pizzerie, gelaterie, piazze storiche, ecc.)
ja_jp: PowerShell.Map を使って、テーマに沿ったインタラクティブな地図を作成します(温泉巡り、ラーメンマップなど)
ko_kr: PowerShell.Map을 사용하여 테마별 지도 만들기 (온천 투어, 맛집 지도 등)
pl_pl: Twórz mapy tematyczne za pomocą PowerShell.Map (restauracje, muzea, parki itp.)
pt_br: Criar mapas temáticos com PowerShell.Map (tours de águas termais, mapas gastronômicos, etc.)
ro_ro: Creați hărți tematice cu PowerShell.Map (tururi la izvoare termale, hărți gastronomice etc.)
ru_ru: Создавайте тематические карты с помощью PowerShell.Map (туры по термальным источникам, гастрономические карты и т. д.)
th_th: สร้างแผนที่เชิงโต้ตอบตามธีมโดยใช้ PowerShell.Map (ทัวร์น้ำพุร้อน, แผนที่อาหาร, ฯลฯ)
tr_tr: PowerShell.Map ile tematik haritalar oluşturun (kaplıca turları, gastronomi haritaları vb.)
uk_ua: Створюйте тематичні карти за допомогою PowerShell.Map (кав'ярні, музеї, парки тощо)
zh_cn: 使用 PowerShell.Map 创建主题地图（茶馆、古迹、小吃街等）
zh_tw: 使用 PowerShell.Map 建立主題地圖（溫泉之旅、美食地圖等）

# Prompt_CreateInteractiveMap_Param_MapTheme
source: Best Pizza Spots, Historic Pubs, Stylish Cafes
ar_sa: معالم سياحية، مطاعم، مقاهي عصرية
de_de: Sehenswürdigkeiten, Biergärten, Historische Orte
es_es: Lugares turísticos, Bares de tapas, Catedrales históricas
fr_fr: Sites touristiques, Cafés charmants, Vignobles
id_id: Tempat wisata, Restoran favorit, Kedai kopi
it_it: Attrazioni turistiche, Pizzerie autentiche, Musei d'arte
ja_jp: 温泉巡り、お花見マップ、東京の観光スポットなど
ko_kr: 관광 명소, 맛집 투어, 카페 탐방
pl_pl: Atrakcje turystyczne, Dobre restauracje, Zamki historyczne
pt_br: Pontos turísticos, Churrascarias, Praias bonitas
ro_ro: Obiective turistice, Restaurante bune, Castele medievale
ru_ru: Достопримечательности, Рестораны, Музеи
th_th: สถานที่ท่องเที่ยว, ร้านอาหารอร่อย, วัดสวยงาม
tr_tr: Turistik yerler, Kebap restoranları, Deniz kenarı kafeler
uk_ua: Визначні місця, Ресторани, Затишні кав'ярні
zh_cn: 景点游览、火锅店、特色茶馆
zh_tw: 景點遊覽、小吃美食、特色咖啡廳

# Prompt_CreateInteractiveMap_Param_TargetArea
source: United States, New York, California
ar_sa: جميع أنحاء البلد، دبي، الرياض
de_de: Ganz Deutschland, Berlin, München
es_es: Toda España, Madrid, Barcelona
fr_fr: Toute la France, Paris, Lyon
id_id: Seluruh Indonesia, Jakarta, Bali
it_it: Tutta Italia, Roma, Milano
ja_jp: 日本全国、東京、大阪など。指定しない場合は会話中に決定
ko_kr: 전국, 서울, 부산
pl_pl: Cała Polska, Warszawa, Kraków
pt_br: Todo o Brasil, São Paulo, Rio de Janeiro
ro_ro: Toată România, București, Cluj-Napoca
ru_ru: Вся Россия, Москва, Санкт-Петербург
th_th: ทั่วประเทศ, กรุงเทพฯ, เชียงใหม่
tr_tr: Tüm Türkiye, İstanbul, Ankara
uk_ua: Вся Україна, Київ, Львів
zh_cn: 全国、北京、上海
zh_tw: 全台灣、台北、台南
